<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN"
       "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en" lang="en">
<head>
  <meta http-equiv="content-type" content="text/html;charset=UTF-8" />
<title>Objekte erzeugen</title>
<meta name="author" content="students from FHB">
<link href="../css/main.css" rel="stylesheet" type="text/css">
</head>
<body text="#000000" bgcolor="#FFFFFF" link="#FF0000" alink="#FF0000" vlink="#FF0000">
<h2>Objekte erzeugen</h2>
<p>
Wenn Sie ein Objekt erzeugen m&ouml;chten, m&uuml;ssen Sie sich erst mit einen Accout einloggen.
Dazu m&uuml;ssen Sie auf die Start- bzw. die Loginseite gehen.
In diesem Beispiel melden wir uns als Subjekt "Vielhauer" an, dass wir zuvor mit dem Kennwort "viel" erstellt haben.
</p>
<img src="../pics/home2.png" alt="" border="0" width="453" height="602">
<p>
Wenn Sie sich erfolgreich eingeloggt haben, kommen Sie ins User-Men&uuml;.
Im oberen Teil sehen Sie den Username mit dem Sie angemeldet sind
und unter die Clearance die Sie besitzen, in unserem Beispiel also die "1" die f&uuml;r "unconfidential" steht.
Nun k&ouml;nnen Sie, je nach Clearance Objekte ertellen und lesen.
</p>
<img src="../pics/login.png" alt="" border="0" width="547" height="544">
<p>
Um ein Objekt zu erzeugen w&auml;hlen Sie "Neues Objekt anlegen"
</p>
<img src="../pics/createObject.png" alt="" border="0" width="547" height="544">
<p>
Es &ouml;ffnet sich das untere Fenster. W&auml;hlen Sie f&uuml;r Ihr Objekt einen Titel und tragen
Sie den Inhalt ein. Bei der Klassifizierung k&ouml;nnen Sie entsprechend dem Bell-LaPadula-Sicherheitsmodelles
nur Objekte erstellen, die Ihrer oder einer h&ouml;heren Clearance entspricht. Klassifizierungen die nicht m&ouml;glich sind,
werden rot hinterlegt und sind nicht ausw&auml;hlbar.
</p>
<img src="../pics/createObject2.png" alt="" border="0" width="337" height="642">
<p>
Hier als Beispiel ein ausgef&uuml;lltes Formular.
</p>
<img src="../pics/createObject3.png" alt="" border="0" width="332" height="657">
<p>
Nur noch auf Absenden dr&uuml;cken und fertig. Als Best&auml;tigung erscheint der untere Bildschirm
in dem der Inhalt des Dokuments nochmal gezeigt wird.
</p>
<img src="../pics/createObject4.png" alt="" border="0" width="547" height="336">
<p>
&Uuml;berpr&uuml;fen Sie Ihre Angabe und klicken Sie auf "Dokumenten&uuml;bersicht" um zur&uuml;ck zur &Uuml;bersicht zu gelangen.
</p>
<img src="../pics/createObject5.png" alt="" border="0" width="552" height="340">
<p>
Im User-Men&uuml; erscheint jetzt das erstellte Objekt. Da die Klasse des Objektes 2 ist
aber Vielhauer nur eine Clearance von 1 hat, kann er das Objekt nicht mehr einsehen.
</p>
<img src="../pics/login2.png" alt="" border="0" width="541" height="571">
<p>
Und so k&ouml;nnte es aussehen wenn man ein paar mehr Objekte erstellt hat. Da in diesem Beispiel Wanka die h&ouml;chste
Clearance hat, kann sie alle Dokumente einsehen.
</p>
<img src="../pics/objects_new.png" alt="" border="0" width="561" height="652">
</body>
</html>